{
  "User": {
   "UserID": "UserID# indicates order of registration",
   "Email": "Email used for registration",
   "Name":"String",
   "Username": "User alias",
   "Password": "Account password",
   "Logins": "Dates when user logged in",
   "Avatar": "User profile picture",
   "VoteCount": "Total number of votes cast",
   "UpPointsCast": "Total number of upvotes cast",
   "DownPointsCast": "Total number of downvotes cast"
 }
}

{
  "Artist": {
    "ArtistID": "ArtistID# indicating order added to database",
    "ArtistName": "Name of the artist (unique)",
    "ArtistAvatar": "Image of artist",
    "Points": {
      "OriginalPoints": "Points earned from an artist's original songs",
      "ArtistUpPoints": "Total number of up points earned",
      "ArtistDownPoints": "Total number of down points received",
      "TotalPoints": "Difference between up points and down points",
      },
    "Albums":[{
        "AlbumID":"ID for each Album",
        "AlbumName":"Name for Album"
        }]
    }
}

{
  "songs":
  {
    "api_path": "/songs/320",
    "full_title": "Hit 'Em Up by 2Pac (Ft. Outlawz)",
    "id": 320,
    "lyrics_owner_id": 7,
    "title": "Hit 'Em Up",
    "primary_artist": {
      "api_path": "/artists/59",
      "id": 59,
      "name": "2Pac",
      "url": "https://genius.com/artists/2pac"
    },
    "lyrics": "\n            \n            [Intro: 2Pac]\nI ain't got no motherfucking friends\nThat's why I fucked your bitch, you fat motherfucker\nTake money\nWest Side, Bad Boy killers\nTake money\nYou know who the realest is\nWe bring it too\nTake money, take money\n\n[Verse 1: 2Pac]\nFirst off, fuck your bitch and the clique you claim\nWestside when we ride, come equipped with game\nYou claim to be a player, but I fucked your wife\nWe bust on Bad Boys, niggas fucked for life\nPlus Puffy trying to see me, weak hearts I rip\nBiggie Smalls and Junior M.A.F.I.A. some mark-ass bitches\nWe keep on coming while we running for your jewels\nSteady gunning, keep on busting at them fools\nYou know the rules\nLil' Caesar go ask your homie how I'll leave you\nCut your young ass up, leave you in pieces, now be deceased\nLittle Kim, don't fuck around with real G's\nQuick to snatch your ugly ass off the streets\nSo fuck peace! I'll let them niggas know it's on for life\nDon't let the Westside ride the night haha\nBad Boy murdered on wax and killed\nFuck with me and get your caps peeled\nYou know\n\n[Hook: 2Pac]\nSee, grab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, oh\nWho shot me, but your punks didn't finish\nNow you about to feel the wrath of a menace\nNigga, I hit 'em up\n\n[Interlude: 2Pac]\nCheck this out, you motherfuckers know what time it is\nI don't know why I'm even on this track\nY'all niggas ain't even on my level\nI'm going to let my little homies ride on you bitch-made ass Bad Boy bitches\nTake money\n\n[Verse 2: Hussein Fatal]\nGet out the way, yo, get out the way, yo\nBiggie Smalls just got dropped\nLittle Moo' pass the MAC and let me hit him in his back\nFrank White needs to get spanked right for setting traps\nLittle accident-murderer, and I ain't never heard of ya\nPoisonous gats attack when I'm serving ya\nSpank you, shank your whole style when I gank\nGuard your rank cause I'ma slam your ass in the paint\nPuffy weaker than the fuckin' block I'm running through, nigga\nAnd I'm smoking Junior M.A.F.I.A. in front of you, nigga\nWith the ready-power\nTucked in my Guess under my Eddie Bauer\nYour clout petty/sour, I push packages every hour\nI hit 'em up\n\n[Hook: 2Pac]\nGrab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, oh\nWho shot me, but your punks didn't finish\nNow you about to feel the wrath of a menace\nNigga, I hit 'em up\n\n[Verse 3: 2Pac]\nPeep how we do it, keep it real as penitentiary steel\nThis ain't no freestyle battle\nAll you niggas getting killed with your mouths open\nTrying to come up off of me, you in the clouds hoping\nSmoking dope, it's like a sherm high\nNiggas think they learned to fly\nBut they burn, motherfucker, you deserve to die\nTalking about you getting money, but it's funny to me\nAll you niggas living bummy – why you fucking with me?\nI'm a self-made millionaire\nThug livin', out of prison, pistols in the air haha\nBiggie, remember when I used to let you sleep on the couch\nAnd beg a bitch to let you sleep in the house?\nNow it's all about Versace, you copied my style\nFive shots couldn't drop me, I took it and smiled\nNow I'm back to set the record straight\nWith my AK, I'm still the thug that you love to hate\nMotherfucker, I'll hit 'em up\n\n[Verse 4: Kadafi]\nI'm from N-E-W Jers' where plenty of murders occurs\nNo points or commas, we bring drama to all you herbs\nNow go check the scenario: Lil' Cease\nI'll bring you fake G's to your knees\nCopping pleas in de Janeiro\nLittle Kim, is you coked up or doped up?\nGet your little Junior Whopper click smoked up\nWhat the fuck, is you stupid?\nI take money, crash and mash through Brooklyn\nWith my click looting, shooting and polluting your block\nWith a 15-shot cocked Glock to your knot\nOutlaw MAFIA clique moving up another notch\nAnd your pop stars popped and get mopped and dropped\nAnd all your fake ass East Coast props\nBrainstormed and locked\n\n[Verse 5: E.D.I. Mean]\nJui-cer\nYou's a beat biter, a Pac style taker\nI'll tell you to your face you ain't shit but a faker\nSofter than Alize with a chaser\nAbout to get murdered for the paper\nE.D.I. Mean approach the scene of the caper\nLike a loc with Little Ceas' in a choke\nGun totin' smoke. We ain't no motherfucking joke\nThug Life, niggas better be known\nBe approaching in the wide open, gun smoking\nNo need for hoping, it's a battle lost\nI got 'em crossed as soon as the funk is bopping off\nNigga, I hit 'em up!\n\n[Outro: 2Pac]\nNow you tell me who won\nI see them, they run haha\nThey don't wanna see us\nTake money\nWhole Junior M.A.F.I.A. clique dressing up trying to be us\nTake money\nHow the fuck they gonna be the mob when we always on our job? We millionaires\nKilling ain't fair, but somebody got to do it\nOh yeah, Mobb Deep: you wanna fuck with us?\nYou little young-ass motherfuckers\nDon't one of you niggas got sickle-cell or something?\nYou're fucking with me, nigga\nYou fuck around and catch a seizure or a heart attack\nYou better back the fuck up\nBefore you get smacked the fuck up\nThis is how we do it on our side\nAny of you niggas from New York that want to bring it:\nBring it!\nBut we ain't singing, we bringing drama\nFuck you and your motherfucking mama\nWe gon' kill all you motherfuckers\nNow when I came out, I told you it was just about Biggie\nThen everybody had to open their mouth with a motherfucking opinion\nWell, this is how we gonna do this:\nFuck Mobb Deep, fuck Biggie, fuck Bad Boy as a staff, record label and as a motherfucking crew!\nAnd if you want to be down with Bad Boy, then fuck you too!\nChino XL: fuck you too!\nAll you motherfuckers, fuck you too!\n(Take money, take money)\nAll of y'all motherfuckers, fuck you; die slow, motherfucker\nMy .44 make sure all y'all kids don't grow!\nYou motherfuckers can't be us or see us\nWe motherfuckin' Thug Life-riders, Westside til we die!\nOut here in California, nigga, we warned ya\nWe'll bomb on you motherfucker! We do our job!\nYou think you mob? Nigga, we the motherfuckin' mob\nAin't nothing but killers and the real niggas\nAll you motherfuckers feel us\nOur shit goes triple and 4-quadruple\nTake money\nYou niggas laugh cause our staff got guns under they motherfuckin' belts\nYou know how it is, when we drop records they felt\nYou niggas can't feel it, we the realest\nFuck 'em, we Bad Boy-killers\nWe killers, we killers, we killers\n\n\n            \n          "
  }
}

